{
  "gradeId": "grade6",
  "storyTitle": "小学算数の完成と中学への扉",
  "description": "分数を完全に使いこなし、比と比例で世界の法則を理解する最後の旅",
  "mainTheme": "関係性と変化を理解することで、数学の本質に近づく",
  "chapters": [
    {
      "chapterId": 1,
      "title": "第1章: 文字と分数の完成",
      "questIds": ["grade6-quest01", "grade6-quest02", "grade6-quest03"],
      "recommendedLevel": 12,
      "intro": "小学算数の最終章が始まります。\n\n「知識の大図書館」に到着したあなた。ここでは、文字を使った式、そして分数の最後の力...分数のかけ算とわり算が待っています。\n\nこれらをマスターすれば、小学算数の計算分野を完全に制覇することになります。そして、中学数学への扉が開かれるのです。",
      "questStories": {
        "grade6-quest01": {
          "before": "図書館の入り口に立ちます。扉には「x + 5」「2 × a」という見慣れない式が刻まれています。\n\n「文字を使えば、一般的なことが表せる。x kmの道のり、1個a円のりんごを3個買った代金は3a円...文字は数学の言語だ」\n\n文字を使った式の世界に踏み出します。",
          "after": "文字と式をマスターしました！xやyという文字を使って、様々な関係を式で表せるようになりました。\n\n「これは中学数学の入り口だ」図書館の賢者が教えてくれます。「次は分数のかけ算だ」",
          "npcDialogue": "図書館の賢者: 文字式を理解した者は、抽象的思考ができる。次は分数の完成だ！"
        },
        "grade6-quest02": {
          "before": "「分数計算の最終章」の部屋に入ります。これまで学んだ分数に、最後の力を加えます。\n\n「2/3 × 3/4 = ?...分数のかけ算は、分子同士、分母同士をかける。2×3/3×4 = 6/12 = 1/2。約分も忘れずに！」\n\n分数×分数の計算を学びます。",
          "after": "分数のかけ算をマスターしました！分子同士、分母同士をかけて約分...分数のかけ算が自由にできるようになりました。\n\n「素晴らしい！最後はわり算だ」",
          "npcDialogue": "分数の守護者: 分数のわり算は、逆数を使う。この奥義を学べ！"
        },
        "grade6-quest03": {
          "before": "分数計算の最後の間に入ります。壁には「2/3 ÷ 3/4 = ?」と書かれています。\n\n「分数のわり算は、逆数をかける。2/3 ÷ 3/4 = 2/3 × 4/3 = 8/9。わり算をかけ算に変えるんだ！」\n\n逆数の概念と、分数わり算の奥義を学びます。",
          "after": "分数のわり算をマスターしました！\n\n光が溢れ出します。「おめでとう！分数の四則演算を完全にマスターした。もう、どんな分数の計算も怖くない」\n\n「分数完全制覇の証」があなたの手に輝きます。小学算数の計算分野を完全に制覇しました！",
          "npcDialogue": "分数の大賢者: 計算を制した者は、次は関係性だ。比の世界へ進もう！"
        }
      },
      "chapterEnd": "第1章完了！\n\n文字と式、分数のかけ算とわり算...抽象的思考と完全な計算力を手に入れました。次は、比と比例という関係性の世界が待っています。"
    },
    {
      "chapterId": 2,
      "title": "第2章: 比と比例の法則",
      "questIds": ["grade6-quest04", "grade6-quest05"],
      "recommendedLevel": 16,
      "intro": "図書館を出たあなたの前に、「関係性の大陸」が広がっています。\n\n比、比例、反比例...2つの量の関係を理解することで、世界の法則が見えてきます。割合とは違う、新しい見方を学ぶ時が来ました。",
      "questStories": {
        "grade6-quest04": {
          "before": "「比の橋」に到着しました。2つの量の関係を、新しい方法で表します。\n\n「2:3、5:8...これが比だ。比の値 = 前の数÷後ろの数。等しい比、最も簡単な整数の比...比は量の関係を表す便利な道具だ」\n\n比の概念と計算を学びます。",
          "after": "比をマスターしました！比の値、等しい比、比を簡単にする...様々な比の問題が解けるようになりました。\n\n「比は、割合の親戚のようなものだ」比の賢者が教えてくれます。「次は比例と反比例だ」",
          "npcDialogue": "比の賢者: 比例は、変化する世界の法則だ。関数の世界へようこそ！"
        },
        "grade6-quest05": {
          "before": "「比例の谷」と「反比例の峰」が見えます。2つの量が変化する世界です。\n\n「yがxに比例する時、y = a×x。xが2倍、3倍になると、yも2倍、3倍になる。反比例は、y = a÷x。xが2倍になると、yは1/2倍になる」\n\nグラフを描きながら、関係を理解します。",
          "after": "比例と反比例をマスターしました！表、式、グラフ...3つの表し方で関係を理解できるようになりました。\n\n「変化する世界の法則を見つけた」関数の守護者が称賛します。「これは、中学の一次関数につながる大切な概念だ」",
          "npcDialogue": "関数の守護者: 第2章完了だ。次は円の完成、そして立体の世界だ！"
        }
      },
      "chapterEnd": "第2章完了！\n\n比と比例、反比例...関係性を理解する力を手に入れました。変化する世界の法則を見つけられるようになったあなたは、数学の本質に一歩近づきました。"
    },
    {
      "chapterId": 3,
      "title": "第3章: 円と立体の極意",
      "questIds": ["grade6-quest06", "grade6-quest07", "grade6-quest08"],
      "recommendedLevel": 20,
      "intro": "旅は佳境に入ります。「幾何の聖域」で、円と立体の最後の秘密を学びます。\n\n円の面積、柱体の体積、対称な図形...幾何学の美しさと論理を完全に理解すれば、図形の世界を制覇することになります。",
      "questStories": {
        "grade6-quest06": {
          "before": "「円の大聖堂」に入ります。巨大な円が、神秘的な光を放っています。\n\n「円の面積 = 半径 × 半径 × 円周率。πr²と書く。なぜこの式になるのか、円を細かく切って長方形に並べ替えれば分かる」\n\n公式の意味を深く理解します。",
          "after": "円の面積をマスターしました！半径から面積を求める、面積から半径を求める...円周と円の面積、両方を使いこなせるようになりました。\n\n「円は完璧な図形だ」円の守護者が微笑みます。「次は立体の発展だ」",
          "npcDialogue": "円の守護者: 次は角柱と円柱だ。底面積×高さ、立体の公式を学ぼう！"
        },
        "grade6-quest07": {
          "before": "「立体の空中神殿」に到着しました。三角柱、四角柱、円柱...様々な柱体が浮かんでいます。\n\n「柱体の体積 = 底面積 × 高さ。三角柱でも、円柱でも、同じ公式だ。底面の形を理解し、その面積を求めることが鍵だ」\n\n柱体の体積を学びます。",
          "after": "角柱と円柱の体積をマスターしました！底面の形を見極め、体積を正確に計算できるようになりました。\n\n「立体を理解する力が、大きく成長したね」立体の守護者が称賛します。",
          "npcDialogue": "立体の守護者: 次は対称だ。線対称と点対称、図形の美しい性質を学ぼう！"
        },
        "grade6-quest08": {
          "before": "「対称の庭園」に入ります。左右対称の美しい図形、回転しても同じに見える図形...対称性の美が広がっています。\n\n「線対称は、折り返して重なる。点対称は、180度回転して重なる。対称性は、自然界にも芸術にもある美しい性質だ」\n\n対称性の概念を学びます。",
          "after": "対称な図形をマスターしました！対称の軸、対称の中心...図形の美しさと規則性を理解できるようになりました。\n\n「図形の美を理解することも、数学の一部だ」庭園の賢者が教えてくれます。",
          "npcDialogue": "庭園の賢者: 第3章完了だ。最終章、応用問題と統計の世界へ！"
        }
      },
      "chapterEnd": "第3章完了！\n\n円の面積、柱体の体積、対称な図形...幾何学の高度な内容を完全に理解しました。図形の世界を自由に探索できる力が身につきました。"
    },
    {
      "chapterId": 4,
      "title": "第4章: 統計と応用、そして旅立ち",
      "questIds": ["grade6-quest09", "grade6-quest10", "grade6-quest11"],
      "recommendedLevel": 24,
      "intro": "いよいよ最終章です。「統計の塔」「速さの応用街道」「比の応用宮殿」...これまで学んだすべての力を使って、難しい応用問題に挑みます。\n\nこれらを乗り越えれば、小学算数の完全制覇です。そして、中学数学という新たな世界への扉が開かれます！",
      "questStories": {
        "grade6-quest09": {
          "before": "「データ分析の塔」に入ります。たくさんのデータが、整理されずに散らばっています。\n\n「度数分布表、ヒストグラム、代表値...データを整理し、視覚化し、分析する。情報化社会では必須の力だ」\n\nデータの調べ方を学びます。",
          "after": "データの調べ方をマスターしました！データを整理し、グラフにし、傾向を読み取る...情報を扱う力が身につきました。\n\n「データを理解することで、正しい判断ができる」データの賢者が教えてくれます。",
          "npcDialogue": "データの賢者: 次は速さの応用だ。旅人算など、難しい問題に挑戦しよう！"
        },
        "grade6-quest10": {
          "before": "「応用問題の街道」を進みます。出会う問題は、どれも一筋縄ではいきません。\n\n「2人が同時に出発して反対方向に進む...旅人算だ。速さの基礎に加え、論理的に考える力が試される」\n\n速さの応用問題に挑戦します。",
          "after": "速さの応用問題を乗り越えました！複雑な状況でも、図を描いて整理し、式を立てて解決...問題解決力が大きく成長しました。\n\n「難しい問題を解く喜びを知ったね」応用の守護者が微笑みます。",
          "npcDialogue": "応用の守護者: 最後は比の応用だ。按分、比例配分...実用的な問題を解こう！"
        },
        "grade6-quest11": {
          "before": "最後の試練、「比の応用宮殿」に到着しました。宮殿の玉座の間には、小学算数の最終問題が待っています。\n\n「3人で分ける時、比が2:3:5だったら...按分の問題だ。比を使って、公平に分配する。比は、実生活で本当に役立つ」\n\nこれが小学算数の最後の試練です！",
          "after": "比の応用をマスターしました！\n\n宮殿全体が光に包まれます。小学算数のすべての守護者が現れます。\n\n「おめでとう！文字と式、分数の完成、比と比例、円と立体、統計、そして難しい応用問題...小学算数のすべてをマスターした！」\n\n玉座に座ると、あなたは「小学算数グランドマスター」の称号を得ました。6年間の旅が、ここに完結します。\n\nしかし、これは終わりではありません。目の前に、大きな扉が現れます。「中学数学への扉」です。\n\n「正負の数、方程式、関数、証明...新しい世界が待っている。準備はいいか？」\n\nあなたは勇気を持って、扉に手をかけます。新たな冒険が、今、始まります！",
          "npcDialogue": "すべての守護者たち: 6年間、よく頑張った！お前は本当の数学の力を手に入れた。中学では、さらに深く美しい世界が待っている。自信を持って進め、グランドマスターよ！",
          "ending": true
        }
      },
      "chapterEnd": "🎉 小学算数、完全制覇！\n\nあなたは6年間かけて、数の基礎から高度な応用まで、すべてをマスターしました。\n\nたし算、ひき算、かけ算、わり算。整数、小数、分数。長さ、重さ、時間、体積。図形、データ、割合、速さ、比例。そして文字を使った式。\n\nすべての力を手に入れたあなたは、もう数学が怖くないはずです。中学数学は、小学算数の延長です。これまで学んだことを土台に、さらに高く、さらに深く、数学の世界を探検しましょう！\n\n中学1年生で、また会いましょう！"
    }
  ],
  "epilogue": "小学算数を完全に制覇し、中学数学への扉を開いたグランドマスターの伝説は、永遠に語り継がれることでしょう..."
}
