{
  "gradeId": "grade1",
  "storyTitle": "数の王国の大冒険",
  "description": "数の力を失った王国を救う、小さな勇者の物語",
  "mainTheme": "数を学ぶことで、世界を救える",
  "chapters": [
    {
      "chapterId": 1,
      "title": "第1章: 失われた数の精霊",
      "questIds": ["grade1-quest01", "grade1-quest02", "grade1-quest03"],
      "recommendedLevel": 1,
      "intro": "数の王国は、かつて1から10までの数の精霊によって守られていました。しかし、ある日、暗黒の魔法使いノーカズが現れ、精霊たちを封印してしまったのです。数を失った王国では、人々は物を数えることができず、困り果てていました。\n\nあなたは勇者として立ち上がり、数の精霊を救う旅に出ます。",
      "questStories": {
        "grade1-quest01": {
          "before": "数の森に入ると、霧の中から小さな光が見えました。「助けて...」と微かな声が聞こえます。これは1から10までの数の精霊たちの声です。\n\n精霊たちを助けるには、正しい数を見つけ出さなければなりません。さあ、冒険の始まりです！",
          "after": "やった！1から10までの数の精霊を全員助け出しました！精霊たちは嬉しそうに光り輝き、あなたの周りを飛び回ります。\n\n「ありがとう、勇者様！」精霊たちが口々にお礼を言います。",
          "npcDialogue": "精霊の長・イチ: 勇者様、次は「たし算の塔」へ向かってください。そこには、数を合わせる力を持つ精霊が囚われています。"
        },
        "grade1-quest02": {
          "before": "たし算の塔は、数の王国で最も高い建物です。塔の頂上には、たし算の精霊プラスが封印されています。\n\n塔を登るには、数を正しく合わせる力が必要です。1から10までの精霊たちが、あなたに力を貸してくれます。",
          "after": "たし算の精霊プラスを解放しました！プラスは嬉しそうに輝き、あなたに新しい力を授けます。\n\nこれで、あなたもたし算の力を使えるようになりました。数を合わせることで、もっと大きな力が生まれるのです。",
          "npcDialogue": "精霊プラス: ありがとう！この力を使えば、もっと強い敵にも立ち向かえるよ。次は「ひき算の谷」だ！"
        },
        "grade1-quest03": {
          "before": "ひき算の谷は、深く暗い場所です。そこには、数を減らす力を持つ精霊マイナスが閉じ込められています。\n\nマイナスを助けるには、数を正しく減らす力が必要です。たし算の力だけでは足りません。新しい力を学びましょう。",
          "after": "ひき算の精霊マイナスを救出しました！これで第1章は完了です。\n\nたし算とひき算の力を手に入れたあなたは、数の王国の真の勇者となりました。精霊たちが集まり、祝福の光を放ちます。",
          "npcDialogue": "精霊マイナス: 勇者様、ノーカズの城はまだ遠いですが、あなたならきっと王国を救えます！"
        }
      },
      "chapterEnd": "第1章完了！\n\nあなたは基本的な数の力（1〜10、たし算、ひき算）を手に入れました。しかし、これはまだ序章に過ぎません。ノーカズの影が、あなたの前に立ちはだかります..."
    },
    {
      "chapterId": 2,
      "title": "第2章: 大きな数の試練",
      "questIds": ["grade1-quest04", "grade1-quest05", "grade1-quest06", "grade1-quest07"],
      "recommendedLevel": 3,
      "intro": "1から10までの数をマスターしたあなたに、次なる試練が待ち受けています。\n\n数の王国の奥地には、20、100という大きな数の精霊が眠っています。彼らを目覚めさせ、味方につけることができれば、ノーカズに対抗する力が得られるでしょう。",
      "questStories": {
        "grade1-quest04": {
          "before": "20の精霊が眠る「ニジュウの泉」に到着しました。泉の水面には20までの数が映し出されています。\n\n精霊を目覚めさせるには、20までの数を正しく理解する必要があります。",
          "after": "20の精霊が目を覚ましました！「よく来たね、勇者よ」精霊は優しく微笑みます。\n\nこれで、あなたは20までの数を使いこなせるようになりました。",
          "npcDialogue": "20の精霊: 次は「繰り上がりの橋」だ。そこでは、もっと難しいたし算の試練が待っているよ。"
        },
        "grade1-quest05": {
          "before": "繰り上がりの橋は、数の王国で最も危険な場所の一つです。橋を渡るには、10を超えるたし算をマスターする必要があります。\n\n7 + 5 = ?　このような問題が、あなたを待ち受けています。",
          "after": "繰り上がりのたし算をマスターしました！橋を無事に渡り切ったあなたに、精霊たちが拍手を送ります。\n\n「素晴らしい！」プラスが嬉しそうに言います。",
          "npcDialogue": "精霊プラス: これで君は、どんな数でも足せるようになったね！次は「繰り下がりの洞窟」だ。"
        },
        "grade1-quest06": {
          "before": "繰り下がりの洞窟は薄暗く、不気味な雰囲気です。ここでは、10から数を引く難しいひき算の試練が待っています。\n\n12 - 5 = ?　このような問題を解いて、洞窟を抜けましょう。",
          "after": "繰り下がりのひき算をマスターしました！洞窟を抜けると、明るい光が差し込みます。\n\nあなたの成長を見て、マイナスも嬉しそうです。",
          "npcDialogue": "精霊マイナス: よくやったね！もうすぐ100の精霊に会えるよ。"
        },
        "grade1-quest07": {
          "before": "ついに、100の精霊が眠る「百の塔」に到着しました。塔は雲を突き抜けるほど高く、頂上には巨大な宝石が輝いています。\n\n100という大きな数を理解できたとき、精霊は目覚めるでしょう。",
          "after": "100の精霊が目を覚ましました！巨大な光の柱が天に昇り、王国中が明るくなります。\n\n「勇者よ、よくぞここまで来た」100の精霊が厳かに語ります。",
          "npcDialogue": "100の精霊: お前は数の真の力を理解し始めている。しかし、ノーカズを倒すにはまだ足りない。最後の試練が待っているぞ。"
        }
      },
      "chapterEnd": "第2章完了！\n\nあなたは大きな数の力（20、100、繰り上がり・繰り下がり）を手に入れました。数の精霊たちは、あなたを真の勇者として認めました。しかし、ノーカズの城はまだ先にあります。"
    },
    {
      "chapterId": 3,
      "title": "第3章: 最終決戦",
      "questIds": ["grade1-quest08", "grade1-quest09", "grade1-quest10"],
      "recommendedLevel": 5,
      "intro": "数の王国の全ての精霊があなたの味方となりました。いよいよ、暗黒の魔法使いノーカズの城に乗り込む時が来ました。\n\nノーカズは時間、形、大きさという3つの力を使って王国を支配しようとしています。これらの力に打ち勝ち、王国に平和を取り戻しましょう！",
      "questStories": {
        "grade1-quest08": {
          "before": "ノーカズの城の第1の門には、時計の守護者が立ちはだかります。「時間を理解せぬ者は、ここを通さぬ！」\n\n何時、何時半という時刻を読む力が必要です。時の精霊トキがあなたを助けてくれます。",
          "after": "時計の守護者を倒しました！第1の門が開き、城の奥へと続く道が現れます。\n\n「時間の力も手に入れたね」トキが微笑みます。",
          "npcDialogue": "精霊トキ: 次は形の守護者だ。図形の力を見せてやろう！"
        },
        "grade1-quest09": {
          "before": "城の第2の門には、形の守護者が待ち構えています。「基本の形すら分からぬ者は通さぬ！」\n\n丸、三角、四角...様々な形を見分ける力が試されます。形の精霊カタチが力を貸してくれます。",
          "after": "形の守護者を倒しました！第2の門が崩れ落ち、ついにノーカズのいる玉座の間への道が開けます。\n\n精霊たちが集まり、最後の戦いへの準備を整えます。",
          "npcDialogue": "精霊カタチ: いよいよ最後の門だ。大きさ比べの試練が待っているよ！"
        },
        "grade1-quest10": {
          "before": "玉座の間の前、最後の門には大きさの守護者が立ちはだかります。そしてその向こうに、暗黒の魔法使いノーカズの姿が見えます。\n\n「どちらが大きいか、どちらが長いか...そんな簡単なことも分からぬ者に、私は倒せぬ！」ノーカズが高笑いします。\n\nこれが最後の試練です。すべての数の力を使って、ノーカズを倒しましょう！",
          "after": "やりました！ノーカズを倒し、数の王国に平和が戻りました！\n\n封印されていたすべての精霊が解放され、王国中が光に包まれます。人々は再び数を数えられるようになり、笑顔が戻りました。\n\n「勇者よ、ありがとう！」王様があなたに感謝の言葉を述べます。精霊たちも、あなたの周りで嬉しそうに踊ります。\n\nあなたは、数の王国の真の英雄となりました！",
          "npcDialogue": "すべての精霊たち: 勇者様、万歳！数の王国を救ってくれて、本当にありがとうございます！",
          "ending": true
        }
      },
      "chapterEnd": "🎉 小学1年生の冒険、完結！\n\nあなたは1から100までの数、たし算、ひき算、時計、形、大きさ比べ...すべてをマスターしました。\n\n数の王国は平和を取り戻し、精霊たちはいつもあなたを見守っています。しかし、冒険はまだ終わりません。小学2年生では、さらに大きな数と、かけ算という新しい力が待っています！\n\n次の冒険でまた会いましょう！"
    }
  ],
  "epilogue": "数の王国を救った勇者の伝説は、後世まで語り継がれることでしょう。\n\nそして、勇者の冒険はこれからも続きます..."
}
