{
  "gradeId": "grade3",
  "storyTitle": "わり算の冒険と分数の秘密",
  "description": "わり算の力を手に入れ、分数と小数の新しい世界を探検する旅",
  "mainTheme": "分けることと測ることで、世界はもっと正確に見える",
  "chapters": [
    {
      "chapterId": 1,
      "title": "第1章: わり算の山脈",
      "questIds": ["grade3-quest01", "grade3-quest02", "grade3-quest03", "grade3-quest04"],
      "recommendedLevel": 6,
      "intro": "数の森を抜けたあなたに、新たな試練が待っています。\n\n目の前にそびえ立つ「わり算の山脈」。ここでは、たし算・ひき算・かけ算に続く、第4の力「わり算」が封印されています。\n\nわり算は「分ける力」と「測る力」を持つ、強力な魔法です。この力を手に入れるため、山脈の頂上を目指しましょう！",
      "questStories": {
        "grade3-quest01": {
          "before": "山脈のふもとに到着しました。10000までの数が刻まれた石碑が立っています。\n\n「1万という大きな数...千の位の次は万の位だ。位がどんどん大きくなっても、仕組みは同じだよ」\n\n山の賢者が現れ、大きな数の世界を教えてくれます。",
          "after": "10000までの数を理解しました！千の位、百の位、十の位、一の位...さらに万の位まで理解が広がりました。\n\n「大きな数が分かれば、計算もできる。さあ、3桁の筆算に進もう！」",
          "npcDialogue": "山の賢者: よくやった。次は3桁の計算だ。筆算の力をさらに高めるぞ！"
        },
        "grade3-quest02": {
          "before": "山道の途中、「筆算の渓谷」に差し掛かります。\n\n「3桁のたし算は、位をそろえて一の位から順に計算するんだ。繰り上がりに注意してね」\n\n大きな数の計算で、渓谷に橋をかけます。",
          "after": "3桁のたし算をマスターしました！位取りに気をつければ、どんなに大きな数でも計算できることが分かりました。\n\n「素晴らしい！次はひき算だ」",
          "npcDialogue": "計算の守護者: 次は3桁のひき算だ。繰り下がりにも対応できるぞ！"
        },
        "grade3-quest03": {
          "before": "「計算の滝」の前に立ちます。3桁のひき算で、滝を登る階段を作ります。\n\n「繰り下がりが2回、3回と続いても大丈夫。一つずつ丁寧に計算すれば、必ず正しい答えにたどり着ける」\n\n慎重に筆算を進めます。",
          "after": "3桁のひき算をマスターしました！複雑な繰り下がりも、落ち着いて計算すれば解けることが分かりました。\n\n滝の上には、かけ算の試練が待っています。",
          "npcDialogue": "滝の守護者: 次は2桁のかけ算だ。筆算の新しい形を学ぶのだ！"
        },
        "grade3-quest04": {
          "before": "山の中腹、「かけ算の高原」に到着しました。\n\n「23 × 4、48 × 7...2桁に1桁をかける。筆算を使えば、九九の範囲を超えた計算もできるんだ！」\n\n新しいかけ算の力を学びます。",
          "after": "2桁のかけ算をマスターしました！九九を使いながら、大きな数のかけ算ができるようになりました。\n\n「よくやった。いよいよわり算だ！」山の賢者が再び現れます。",
          "npcDialogue": "山の賢者: ここからが本番だ。第1章最後の試練、わり算の基礎を学ぼう！"
        }
      },
      "chapterEnd": "第1章完了！\n\n大きな数と3桁の計算、2桁のかけ算...計算の力が確実に成長しています。次は、いよいよわり算の世界が待っています！"
    },
    {
      "chapterId": 2,
      "title": "第2章: わり算の力を手に入れろ",
      "questIds": ["grade3-quest05", "grade3-quest06"],
      "recommendedLevel": 9,
      "intro": "山脈の頂上近く、「わり算の神殿」が見えてきました。\n\nここでは、新しい計算「わり算」の力が封印されています。等しく分ける力、いくつ分あるかを測る力...わり算は、かけ算の逆の力を持っています。\n\nこの力を手に入れれば、あなたは四則演算のすべてを使いこなせるようになります！",
      "questStories": {
        "grade3-quest05": {
          "before": "わり算の神殿の入り口に立ちます。扉には「12 ÷ 3 = ?」と刻まれています。\n\n「わり算には2つの意味がある。『12個を3人で等しく分けたら、1人何個？』これが等分除。『12個を3個ずつに分けたら、何人分？』これが包含除だ」\n\nわり算の本質を学び始めます。",
          "after": "わり算の基礎をマスターしました！等分除と包含除、両方の意味を理解し、九九を使ってわり算が解けるようになりました。\n\n神殿の扉が開き、さらに奥へと続く道が現れます。「次は、あまりのあるわり算だ」",
          "npcDialogue": "わり算の守護者: よくやった。しかし、いつも割り切れるとは限らない。あまりのある世界へ進もう。"
        },
        "grade3-quest06": {
          "before": "神殿の奥の間、「あまりの部屋」に入ります。ここでは、割り切れないわり算が待っています。\n\n「17 ÷ 5 = 3 あまり 2。割り切れない時は、あまりを表すんだ。そして必ず、『あまり < わる数』を確認するのだぞ」\n\n検算も学びます。「わる数 × 商 + あまり = わられる数」",
          "after": "あまりのあるわり算をマスターしました！\n\n神殿が光に包まれます。わり算の守護者が現れ、あなたに「わり算の勲章」を授けます。「おめでとう。四則演算のすべてを手に入れたね。これで、どんな計算も解ける！」\n\n山頂から見える景色には、新しい世界が広がっています...分数と小数の世界です。",
          "npcDialogue": "わり算の守護者: 四則演算を制した者は、次は新しい数の世界へ。分数と小数が待っているぞ！"
        }
      },
      "chapterEnd": "第2章完了！\n\nわり算の力を手に入れたあなたは、たし算、ひき算、かけ算、わり算...すべての基本計算を使いこなせるようになりました。次は、新しい数の表し方を学びます。"
    },
    {
      "chapterId": 3,
      "title": "第3章: 分数と小数の新世界",
      "questIds": ["grade3-quest07", "grade3-quest08", "grade3-quest09", "grade3-quest10"],
      "recommendedLevel": 12,
      "intro": "山を下りたあなたの前に、不思議な2つの世界が広がっています。\n\n左には「分数の谷」、右には「小数の湖」。これまで学んだ整数だけでは表せない、新しい数の世界です。\n\n1/2、0.5...表し方は違っても、同じものを表している...数の世界は、もっと広く、もっと深いのです。",
      "questStories": {
        "grade3-quest07": {
          "before": "分数の谷に入ります。1つのリンゴを2つに分けた形、ピザを4つに分けた形...様々な分数が舞っています。\n\n「1/2、1/3、1/4...1つのものを等しく分けた時の1つ分が分数だ。分子と分母、この2つの数で表すんだよ」\n\n分数の基礎を学びます。",
          "after": "分数の基礎を理解しました！分母が同じ分数なら、たし算やひき算もできることが分かりました。\n\n「分数は、整数では表せない細かい量を表す。便利な数だね」",
          "npcDialogue": "分数の賢者: 次は小数だ。もう一つの新しい数の表し方を学ぼう！"
        },
        "grade3-quest08": {
          "before": "小数の湖に到着しました。湖面には、0.1、0.5、1.2...小数点のついた数が波紋を描いています。\n\n「小数点の右側が、1より小さい部分だ。0.1は1/10、0.01は1/100...分数と同じものを、違う形で表しているんだ」\n\n小数の概念を学びます。",
          "after": "小数の基礎を理解しました！小数は、分数の別の表し方であり、たし算やひき算もできることが分かりました。\n\n「小数も分数も、どちらも大切な数の表し方だね」",
          "npcDialogue": "小数の賢者: 数の表し方を学んだ。次は測る力、長さの世界だ！"
        },
        "grade3-quest09": {
          "before": "「長さの大陸」に上陸しました。これまでcm、mmを学びましたが、さらに大きな単位が待っています。\n\n「km...キロメートル。1km = 1000m。遠くの距離を測る時に使う単位だ」\n\n地図を広げ、長い道のりを計算します。",
          "after": "kmと単位変換をマスターしました！mm、cm、m、km...長さの単位を自由に変換できるようになりました。\n\n「これで、どんな長さも測れるね」",
          "npcDialogue": "長さの賢者: 次は重さだ。g、kg、t...重さの単位を学ぼう！"
        },
        "grade3-quest10": {
          "before": "「重さの島」に到着しました。様々な重さのものが並んでいます。\n\n「g、kg、t...重さの単位だ。1kg = 1000g、1t = 1000kg。ものの重さを正確に表すことができる」\n\n単位変換と計算を学びます。",
          "after": "重さの単位をマスターしました！軽いものから重いものまで、適切な単位で表せるようになりました。\n\n第3章の冒険が終わりに近づいています。",
          "npcDialogue": "重さの賢者: 次は時間と図形の世界だ。最終章が待っているぞ！"
        }
      },
      "chapterEnd": "第3章完了！\n\n分数と小数、長さと重さ...数の世界が大きく広がりました。新しい数の表し方を使いこなせるようになったあなたは、さらに深い世界へ進めます。"
    },
    {
      "chapterId": 4,
      "title": "第4章: 時間と図形の最終試練",
      "questIds": ["grade3-quest11", "grade3-quest12", "grade3-quest13"],
      "recommendedLevel": 15,
      "intro": "旅の最後、「時の神殿」と「図形の城」が見えてきました。\n\n時間の長さを計算する力、円の美しさを理解する力、データを整理して分析する力...これらをすべて手に入れれば、小学3年生の数学をマスターします！",
      "questStories": {
        "grade3-quest11": {
          "before": "時の神殿に入ります。無数の時計が時を刻んでいます。\n\n「午前9時に出発して、午後2時に到着。何時間かかった？時刻と時間、そして時間の長さの計算...時を操る力を学ぼう」\n\n時間計算の試練が始まります。",
          "after": "時間と時刻をマスターしました！午前と午後、経過時間の計算...時間を自由に扱えるようになりました。\n\n「時を理解することは、人生を豊かにする」時の賢者が教えてくれます。",
          "npcDialogue": "時の賢者: 次は円だ。完全なる図形の美しさを学ぼう！"
        },
        "grade3-quest12": {
          "before": "「円の聖域」に到着しました。完璧な円が、光を放っています。\n\n「円は、中心から等しい距離にある点の集まり。半径、直径...円には美しい性質がある。コンパスを使って、円を描く力も学ぼう」\n\n円と球の世界を学びます。",
          "after": "円の性質をマスターしました！中心、半径、直径...円の基本が理解でき、コンパスで正確な円が描けるようになりました。\n\n「円は、自然界にもたくさんある。美しい図形だね」",
          "npcDialogue": "円の守護者: 最後はデータだ。情報を整理する力を学ぼう！"
        },
        "grade3-quest13": {
          "before": "最後の試練、「データの塔」に到着しました。塔の中には、様々なデータが散らばっています。\n\n「棒グラフを使えば、数の大小が一目で分かる。データを整理し、視覚化する...情報を読み解く力が試される！」\n\nこれが小学3年生の最終試練です！",
          "after": "棒グラフをマスターしました！\n\n塔の頂上に立つと、光が溢れ出します。「おめでとう！小学3年生の数学を完全にマスターした！」\n\n四則演算、分数、小数、長さ、重さ、時間、円、グラフ...すべての力を手に入れたあなたは、「小学3年の冒険者」の称号を得ました。\n\n遠くに見える次の世界...小学4年生では、億兆の巨大な数、2桁の計算、角度と面積という新たな力が待っています！",
          "npcDialogue": "すべての守護者たち: よくぞここまで来た、冒険者よ！小学4年生では、さらに広く深い世界が待っているぞ！",
          "ending": true
        }
      },
      "chapterEnd": "🎉 小学3年生の数学、完全制覇！\n\nあなたは四則演算、分数、小数、単位、時間、円、グラフ...すべてをマスターしました。\n\nわり算という新しい力を手に入れ、新しい数の表し方を学んだあなたは、数学の世界をさらに広く理解できるようになりました。小学4年生では、億兆の大きな数、2桁の計算、図形の深い世界が待っています！\n\n次の冒険で、また会いましょう！"
    }
  ],
  "epilogue": "わり算を制し、分数と小数の世界を開いた冒険者の物語は、次の世代に語り継がれることでしょう..."
}
