{
  "gradeId": "grade2",
  "storyTitle": "数の森の守護者たち",
  "description": "100までの数、かけ算の魔法、そして図形の謎を解き明かす冒険",
  "mainTheme": "協力と工夫で、どんな問題も解決できる",
  "chapters": [
    {
      "chapterId": 1,
      "title": "第1章: 数の森の危機",
      "questIds": ["grade2-quest01", "grade2-quest02", "grade2-quest03", "grade2-quest04"],
      "recommendedLevel": 4,
      "intro": "数の王国を救ったあなたは、新たな冒険の地「数の森」に到着しました。\n\nここでは、100までの大きな数、たし算とひき算の筆算を使いこなす「計算の守護者」たちが住んでいます。\n\nしかし、森に異変が起きています。数の木が枯れ始め、計算の力が弱まっているのです。「筆算の賢者」があなたを待っています。\n\n「勇者よ、森を救うには、より大きな数と筆算の力が必要だ。君なら、きっとできる！」",
      "questStories": {
        "grade2-quest01": {
          "before": "数の森の入り口に立つあなた。目の前には巨大な数の木が立っています。\n\n「この森には、100までの大きな数が住んでいる。10が10個で100...位の仕組みを理解すれば、どんな大きな数も扱えるぞ！」\n\n筆算の賢者が、古い巻物を広げます。「まずは、100までの数を理解するのだ」",
          "after": "100までの数をマスターしました！十の位、一の位...位の仕組みが理解できたあなたは、森の奥へと進めるようになりました。\n\n数の木が少し元気を取り戻します。「素晴らしい！次は筆算の力を学ぶのだ」",
          "npcDialogue": "筆算の賢者: 次は2けたのひき算だ。筆算を使えば、大きな数も計算できるぞ！"
        },
        "grade2-quest02": {
          "before": "森の奥に進むと、「筆算の泉」が見えてきます。泉の水が濁っています。\n\n「2けたのひき算は、位をそろえて計算するんだ。一の位から順に、繰り下がりに注意してね」\n\n筆算の力を使って、泉を浄化します。",
          "after": "筆算でひき算をマスターしました！位をそろえて、繰り下がりもバッチリ。泉の水が透明に戻り、計算の力が溢れ出します。\n\n「よくやった！次はたし算だ」",
          "npcDialogue": "計算の精霊: 素晴らしい！次は2けたのたし算、繰り上がりにも挑戦だ！"
        },
        "grade2-quest03": {
          "before": "「計算の橋」の前に立ちます。橋は壊れかけており、修復が必要です。\n\n「2けたのたし算で、橋を修復するんだ。繰り上がりがある時は、十の位に1を加えるのを忘れずに！」\n\nたし算の筆算で、計算の橋を修復します。",
          "after": "筆算のたし算をマスターしました！繰り上がりも完璧です。計算の橋が修復され、森の奥へと続く道が開かれます。\n\n「君の計算の力は確かだ。次は長さの試練だ！」",
          "npcDialogue": "橋の守護者: よくやった。次は「長さの谷」だ。ものさしの力を学ぶのだ！"
        },
        "grade2-quest04": {
          "before": "「長さの谷」に到着しました。様々な長さのものが並んでいます。\n\n「cm、mm...長さの単位を理解し、ものさしで測る力が必要だ。30cmのものさし、1mのものさし...使い分けるんだ」\n\n長さの概念を学びます。",
          "after": "長さの単位と測り方をマスターしました！cm、mm、m...様々な長さを正確に測れるようになりました。\n\n森の奥から、かけ算の声が聞こえてきます...「次は、かけ算の世界だ」",
          "npcDialogue": "長さの賢者: 第1章完了だ。次は「かけ算の塔」が待っているぞ！"
        }
      },
      "chapterEnd": "第1章完了！\n\n100までの数、筆算のたし算・ひき算、長さ...計算の基礎を固めたあなたは、森の危機を少しずつ解決しています。次は、かけ算の力が待っています！"
    },
    {
      "chapterId": 2,
      "title": "第2章: かけ算の塔と時の神殿",
      "questIds": ["grade2-quest05", "grade2-quest06", "grade2-quest07"],
      "recommendedLevel": 7,
      "intro": "森の中央に、高くそびえ立つ「かけ算の塔」が見えます。\n\nここでは、九九という強力な魔法が封印されています。九九をマスターすれば、森の力を取り戻せるでしょう。\n\nそして、その先には「時の神殿」が待っています。時刻と時間の秘密を解き明かす時が来ました。",
      "questStories": {
        "grade2-quest05": {
          "before": "かけ算の塔の入り口に立ちます。塔の扉には「九九の試練」と刻まれています。\n\n「かけ算は、同じ数を何度も足すことと同じだ。2×3は2+2+2と同じ...でも、かけ算なら一瞬で計算できる！」\n\n九九の魔法を学び始めます。",
          "after": "九九をマスターしました！2の段から9の段まで、すべての九九を覚えたあなたは、かけ算の魔法を手に入れました。\n\n塔の扉が開き、中から光が溢れ出します。「素晴らしい！かけ算の力を手に入れたね」",
          "npcDialogue": "九九の守護者: よくやった！次は時の神殿だ。時刻と時間の秘密を学ぶのだ。"
        },
        "grade2-quest06": {
          "before": "時の神殿に到着しました。神殿の中では、無数の時計が時を刻んでいます。\n\n「時刻は『今、何時何分か』を表す。時間は『どれだけの時が流れたか』を表す。この違いを理解することが重要だ」\n\n時計の針を読み、時間の流れを理解します。",
          "after": "時刻と時間をマスターしました！午前・午後、何時何分...時計が読めるようになり、時間の計算もできるようになりました。\n\n時の神殿が祝福の光を放ちます。「時を理解する者は、人生を豊かにする」",
          "npcDialogue": "時の賢者: 次は大きな数だ。1000までの数の世界へ進もう！"
        },
        "grade2-quest07": {
          "before": "「千の丘」に登ります。ここでは、100を超える大きな数が風に舞っています。\n\n「100が10個で1000...位がさらに増えるんだ。百の位、十の位、一の位...位の仕組みは同じだよ」\n\n1000までの数の世界を学びます。",
          "after": "1000までの数をマスターしました！大きな数も、位の仕組みを理解すれば怖くありません。\n\n「よくやった。次は最後の章、図形と量の世界だ！」",
          "npcDialogue": "大数の守護者: 第2章完了だ。次は図形の謎と、かさ・水の量が待っているぞ！"
        }
      },
      "chapterEnd": "第2章完了！\n\nかけ算の九九、時刻と時間、1000までの大きな数...実用的な力を手に入れたあなたは、森の力をさらに取り戻しました。最後の章が待っています！"
    },
    {
      "chapterId": 3,
      "title": "第3章: 図形の神殿と最終試練",
      "questIds": ["grade2-quest08", "grade2-quest09", "grade2-quest10"],
      "recommendedLevel": 10,
      "intro": "森の最深部、「図形の神殿」が見えてきました。\n\nここでは、三角形と四角形の謎、箱の形の秘密、そして分数という新しい概念が待っています。\n\nこれらをすべて理解すれば、数の森は完全に蘇り、あなたは真の守護者となるでしょう！",
      "questStories": {
        "grade2-quest08": {
          "before": "図形の神殿の広間に入ります。様々な図形が浮かんでいます。\n\n「三角形は3つの辺、四角形は4つの辺...直線で囲まれた形だ。それぞれに頂点と辺がある」\n\n図形の基礎を学びます。",
          "after": "三角形と四角形をマスターしました！辺の数、頂点の数...図形の基本が理解できました。\n\n「よくやった！次は立体、箱の形だ」",
          "npcDialogue": "図形の賢者: 次は箱の形だ。立体の世界を理解するのだ！"
        },
        "grade2-quest09": {
          "before": "立体の部屋に入ります。箱の形が積み上げられています。\n\n「箱の形には、面、辺、頂点がある。平面の図形とは違う、立体の世界だ」\n\n立体図形の基礎を学びます。",
          "after": "箱の形をマスターしました！面、辺、頂点...立体図形の基本が理解できました。\n\n「素晴らしい！最後は分数だ。新しい数の世界へ進もう」",
          "npcDialogue": "立体の守護者: いよいよ最後だ。分数の部屋で最終試練が待っている！"
        },
        "grade2-quest10": {
          "before": "最後の部屋、「分数の間」に入ります。ここには、森の守護者の長が待っています。\n\n「分数は、1つのものを等しく分けた時の数だ。1/2、1/3、1/4...新しい数の表し方だよ」\n\n最後の試練、分数の基礎を学びます。",
          "after": "分数の基礎をマスターしました！\n\n森の守護者の長が現れます。「よくやった、勇者よ。100までの数、筆算、かけ算、時間、図形、分数...すべてをマスターした君は、数の森の守護者だ！」\n\n光に包まれたあなたは、正式に「数の森の守護者」となりました。森全体が輝き、数の木々が完全に蘇ります。\n\n動物たちが集まり、あなたを祝福します。数の森に、再び平和が訪れました！",
          "npcDialogue": "森の守護者の長: おめでとう、小学2年生の数学を完全にマスターした！小学3年生では、さらに大きな数、わり算、円という新しい冒険が待っているぞ！",
          "ending": true
        }
      },
      "chapterEnd": "🎉 小学2年生の数学、完全制覇！\n\nあなたは100までの数、筆算、かけ算の九九、時刻と時間、1000までの数、長さ、かさ、図形、分数...すべてをマスターしました。\n\n数の森の守護者として、あなたの冒険は続きます。小学3年生では、わり算、大きな数、円、小数という新たな力が待っています！\n\n次の冒険で、また会いましょう！"
    }
  ],
  "epilogue": "数の森に平和を取り戻した守護者の物語は、永遠に語り継がれることでしょう..."
}
