{
  "gradeId": "grade5",
  "storyTitle": "小数と分数の極意、そして速さの世界",
  "description": "小数と分数を完全に使いこなし、速さと割合の奥義を学ぶ冒険",
  "mainTheme": "精密さと効率、比較と変換で世界の本質が見えてくる",
  "chapters": [
    {
      "chapterId": 1,
      "title": "第1章: 小数の完成への道",
      "questIds": ["grade5-quest01", "grade5-quest02", "grade5-quest03"],
      "recommendedLevel": 10,
      "intro": "小学4年生の冒険を終えたあなたに、さらなる挑戦が待っています。\n\n「数の大陸」の奥地に、「小数の完成塔」がそびえ立っています。これまで学んだ小数のたし算・ひき算に加え、かけ算とわり算を完全にマスターすれば、小数の真の力を手に入れることができます。\n\nこれは、精密さを極める旅の始まりです！",
      "questStories": {
        "grade5-quest01": {
          "before": "塔のふもとに立ちます。入り口には「数のしくみを理解せよ」と刻まれています。\n\n「整数も小数も、10倍すると位が1つ上がる。1/10にすると位が1つ下がる...この仕組みを完全に理解することが、すべての基礎だ」\n\n数の守護者が、数直線を広げて教えてくれます。",
          "after": "整数と小数のしくみを完全に理解しました！10倍、1/10の関係、位の移動...数の本質が見えてきました。\n\n「よくやった。この理解があれば、小数の計算も怖くない」守護者が微笑みます。",
          "npcDialogue": "数の守護者: 次は小数のかけ算だ。0.3 × 2.4...小数点の扱いを学ぼう！"
        },
        "grade5-quest02": {
          "before": "塔の2階、「かけ算の間」に入ります。小数のかけ算が壁一面に書かれています。\n\n「小数のかけ算は、整数と同じように計算して、最後に小数点の位置を決める。小数第一位同士なら、答えは小数第二位まで...法則を理解しよう」\n\n小数×小数の試練が始まります。",
          "after": "小数のかけ算をマスターしました！2.5 × 3.6、0.8 × 0.4...小数点の位置を正確に決められるようになりました。\n\n「素晴らしい！次はわり算だ」",
          "npcDialogue": "計算の賢者: 小数のわり算は難しい。しかし、整数に直す技を使えば解ける！"
        },
        "grade5-quest03": {
          "before": "塔の3階、「わり算の間」。ここが小数計算の最後の試練です。\n\n「6.4 ÷ 0.8...わる数を整数にするため、両方を10倍する。64 ÷ 8 = 8。小数のわり算は、整数のわり算に変換すればいいんだ！」\n\n小数のわり算の奥義を学びます。",
          "after": "小数のわり算をマスターしました！\n\n塔の最上階に到達すると、光が溢れ出します。「小数の四則演算を完全に使いこなした者に、『精密計算の勲章』を授ける」\n\nあなたの手に、美しい勲章が輝きます。小数の世界を完全に制覇しました！",
          "npcDialogue": "塔の守護者: おめでとう。次は2桁のわり算だ。さらに難しい計算に挑戦しよう！"
        }
      },
      "chapterEnd": "第1章完了！\n\n小数の四則演算を完全にマスターしました。精密な計算ができるようになったあなたは、実生活でもこの力を活かせるでしょう。次は、整数の難しいわり算と分数の世界です。"
    },
    {
      "chapterId": 2,
      "title": "第2章: 分数の完成と立体の秘密",
      "questIds": ["grade5-quest04", "grade5-quest05", "grade5-quest06"],
      "recommendedLevel": 14,
      "intro": "小数を完全に使いこなしたあなたに、次なる試練が待っています。\n\n「わり算の険しい道」と「分数の深い森」、そして「立体の空中城」。整数の難しいわり算、異なる分母の分数計算、そして3次元の体積...これらをマスターすれば、計算の真の達人となります！",
      "questStories": {
        "grade5-quest04": {
          "before": "険しい山道を登ります。目の前には「2桁÷2桁の壁」が立ちはだかっています。\n\n「84 ÷ 12、156 ÷ 13...2桁で割るのは難しい。まず商を見積もり、かけ算で確かめる...この繰り返しだ」\n\n見積もりの力を鍛えます。",
          "after": "2桁÷2桁のわり算をマスターしました！見積もる力、試行錯誤する力...難しい計算を乗り越える力が身につきました。\n\n「この粘り強さが、数学の力だ」山の賢者が称賛します。",
          "npcDialogue": "山の賢者: 次は分数だ。異なる分母の計算、通分の技を学ぼう！"
        },
        "grade5-quest05": {
          "before": "分数の森に入ります。これまでは分母が同じ分数しか計算できませんでしたが、今日は違います。\n\n「1/2 + 1/3...分母が違う時は、通分する。共通の分母に揃えるんだ。1/2 = 3/6、1/3 = 2/6、だから 3/6 + 2/6 = 5/6！」\n\n通分と約分、分数計算の奥義を学びます。",
          "after": "異分母の分数計算をマスターしました！通分と約分を使いこなし、どんな分数の計算も解けるようになりました。\n\n「分数は、精密さを表す強力な道具だ」分数の賢者が教えてくれます。",
          "npcDialogue": "分数の賢者: 次は立体だ。3次元の世界、体積を学ぼう！"
        },
        "grade5-quest06": {
          "before": "空中に浮かぶ「立体の城」に到着しました。直方体、立方体...様々な立体が浮かんでいます。\n\n「体積 = たて × よこ × 高さ。3次元の広がりを数で表すんだ。単位は㎤、㎥...立体の大きさを測る力を手に入れよう」\n\n体積の概念と計算を学びます。",
          "after": "体積をマスターしました！たて・よこ・高さから体積を求め、単位変換もできるようになりました。\n\n「3次元の世界を数で捉えられるようになったね」立体の守護者が祝福します。",
          "npcDialogue": "立体の守護者: 第2章完了だ。次は割合、最も重要で最も難しい世界が待っている！"
        }
      },
      "chapterEnd": "第2章完了！\n\n難しいわり算、異分母の分数計算、体積...高度な計算力を手に入れました。次は、割合と速さという実生活で最も使う力を学びます。"
    },
    {
      "chapterId": 3,
      "title": "第3章: 割合の奥義と速さの法則",
      "questIds": ["grade5-quest07", "grade5-quest08"],
      "recommendedLevel": 18,
      "intro": "冒険の中盤、最大の難関が待ち受けています。\n\n「割合の迷宮」と「速さの街道」。割合は、2つの量を比べる強力な概念です。そして速さは、移動する世界を記述する法則です。\n\nこれらは難しい...しかし、理解すれば実生活で最も役立つ力となるでしょう！",
      "questStories": {
        "grade5-quest07": {
          "before": "割合の迷宮に入ります。「もとにする量」「比べられる量」「割合」...3つの関係が複雑に絡み合っています。\n\n「割合 = 比べられる量 ÷ もとにする量。そして百分率...パーセント。定価の20%引き、消費税10%...割合は生活のあちこちにある」\n\n迷宮を進みながら、割合の本質を学びます。",
          "after": "割合をマスターしました！もとにする量を見極め、割合を求める、または割合から量を求める...様々な問題が解けるようになりました。\n\n「割合は難しい。でも理解すれば、世界がもっとよく見える」迷宮の賢者が教えてくれます。",
          "npcDialogue": "割合の賢者: よくやった。次は速さだ。道のり、速さ、時間...3つの関係を学ぼう！"
        },
        "grade5-quest08": {
          "before": "「速さの街道」を走ります。様々な乗り物が、異なる速さで移動しています。\n\n「速さ = 道のり ÷ 時間。時速60km、分速80m、秒速20m...単位時間あたりの道のりが速さだ。そして、道のり = 速さ × 時間、時間 = 道のり ÷ 速さ」\n\n速さ・道のり・時間の三角形の関係を学びます。",
          "after": "速さをマスターしました！速さから道のりを求める、時間を求める...自由に変換できるようになりました。\n\n「速さは、動く世界を理解する鍵だ」速さの守護者が微笑みます。「さあ、次は図形の世界だ！」",
          "npcDialogue": "速さの守護者: 第3章完了だ。次は図形、正多角形と面積の美しい世界へ！"
        }
      },
      "chapterEnd": "第3章完了！\n\n割合と速さ、2つの難関を突破しました。比べる力、変換する力...これらは実生活で最も役立つ数学の力です。次は、図形の美しい世界が待っています。"
    },
    {
      "chapterId": 4,
      "title": "第4章: 図形の美と統計の知恵",
      "questIds": ["grade5-quest09", "grade5-quest10", "grade5-quest11", "grade5-quest12"],
      "recommendedLevel": 22,
      "intro": "旅の最終段階、「幾何の楽園」が見えてきました。\n\n正多角形の美しさ、円周の神秘、三角形と平行四辺形の面積公式、そして平均という統計の知恵...これらすべてを手に入れれば、小学5年生の数学をマスターします！",
      "questStories": {
        "grade5-quest09": {
          "before": "「正多角形の広場」に到着しました。正三角形、正方形、正五角形、正六角形...美しく規則正しい図形が並んでいます。\n\n「すべての辺が等しく、すべての角が等しい...それが正多角形だ。そして円周 = 直径 × 円周率。円周率は約3.14...永遠に続く不思議な数だ」\n\n正多角形と円周の関係を学びます。",
          "after": "正多角形と円周をマスターしました！図形の対称性の美しさ、円周の計算...幾何学の魅力に触れました。\n\n「美しいね」図形の賢者が微笑みます。「次は面積だ」",
          "npcDialogue": "図形の賢者: 次は三角形と平行四辺形の面積だ。公式の意味を理解しよう！"
        },
        "grade5-quest10": {
          "before": "「面積の殿堂」に入ります。これまで長方形と正方形の面積しか求められませんでしたが、今日は違います。\n\n「三角形の面積 = 底辺 × 高さ ÷ 2。平行四辺形の面積 = 底辺 × 高さ。なぜこうなるか、図形を変形させて理解しよう」\n\n公式の意味を深く学びます。",
          "after": "三角形と平行四辺形の面積をマスターしました！公式を暗記するだけでなく、なぜその式になるのかを理解できました。\n\n「公式の意味を理解することが、真の数学だ」殿堂の守護者が教えてくれます。",
          "npcDialogue": "殿堂の守護者: 次は平均だ。データを代表する値を学ぼう！"
        },
        "grade5-quest11": {
          "before": "「統計の館」に入ります。たくさんのデータが並んでいます。\n\n「平均 = 合計 ÷ 個数。たくさんのデータを1つの値で代表する...それが平均だ。テストの平均点、平均気温...平均は、データの中心を表す」\n\n平均の概念と計算、そして活用方法を学びます。",
          "after": "平均をマスターしました！データを集めて平均を求める、平均から合計を求める...様々な問題が解けるようになりました。\n\n「データを理解する力は、現代社会で必須だ」統計の賢者が教えてくれます。",
          "npcDialogue": "統計の賢者: 最後は単位量あたりだ。効率と密度を比べる力を学ぼう！"
        },
        "grade5-quest12": {
          "before": "最後の試練、「単位量あたりの塔」に到着しました。\n\n「1㎡あたりの人数、1日あたりの生産量、1Lあたりの値段...単位量あたりで比べることで、公平に比較できる。これは割合の応用だ」\n\nこれが小学5年生の最終試練です！",
          "after": "単位量あたりの大きさをマスターしました！\n\n塔の頂上に立つと、虹色の光が溢れ出します。「おめでとう！小学5年生の数学を完全にマスターした！」\n\n小数の完成、分数の完成、割合、速さ、体積、正多角形、面積、平均、単位量あたり...すべての力を手に入れたあなたは、「小学5年の数学マスター」の称号を得ました。\n\n遠くに見える次の世界...小学6年生では、分数のかけ算わり算、比例反比例、円の面積という最後の力が待っています！",
          "npcDialogue": "すべての守護者たち: よくぞここまで来た！小学5年は算数で最も難しい学年だ。それを制したお前は素晴らしい！小学6年生で、小学算数を完成させよう！",
          "ending": true
        }
      },
      "chapterEnd": "🎉 小学5年生の数学、完全制覇！\n\nあなたは小数と分数の完成、割合と速さ、体積、図形の面積、統計...最も難しく、そして最も実用的な数学をすべてマスターしました。\n\n小学5年生は算数で最も難しい学年と言われています。それを乗り越えたあなたは、もう数学が怖くないはずです。小学6年生では、小学算数の完成が待っています！\n\n次の冒険で、また会いましょう！"
    }
  ],
  "epilogue": "小数と分数を極め、割合と速さの奥義を会得した数学マスターの物語は、永遠に語り継がれることでしょう..."
}
