{
  "gradeId": "jh1",
  "storyTitle": "数理世界の守護者",
  "description": "正と負、未知数と方程式。対立する力を統べ、数理世界のバランスを取り戻せ",
  "mainTheme": "数学の本質は、バランスと調和である",
  "chapters": [
    {
      "chapterId": 1,
      "title": "第1章: 正と負の二つの世界",
      "questIds": ["jh1-quest01", "jh1-quest02", "jh1-quest03"],
      "recommendedLevel": 10,
      "intro": "数理世界は、かつて正の世界と負の世界が調和して存在していました。しかし、ゼロポイント（原点）を守護する「バランスの守護者」が姿を消してから、二つの世界は分断されてしまいました。\n\nあなたは新たな守護者として、正と負の力を理解し、再び世界に調和をもたらす使命を負います。",
      "questStories": {
        "jh1-quest01": {
          "before": "正の世界と負の世界の境界、ゼロポイントに立つあなた。\n\n「正の数と負の数、両方の力を理解しなければ、真の守護者にはなれない」先代の守護者の声が聞こえます。\n\n温度、高度、損益...現実世界では正と負が共存しています。その本質を学ぶ時が来ました。",
          "after": "正負の数の本質を理解しました！数直線上で、正と負が対称に存在することを体感したあなたは、バランスの力の片鱗を掴みました。\n\n「よくやった。次は文字の力だ」守護者の声が響きます。",
          "npcDialogue": "先代の守護者: 数は具体的な値だけではない。未知なるものを表す「文字」の力を学べ。"
        },
        "jh1-quest02": {
          "before": "文字の神殿に到着しました。ここでは、xやyという文字が数の代わりに舞っています。\n\n「文字は未知数を表す。まだ分からないものを、分かるものに変える力...それが文字式だ」\n\n抽象の世界への第一歩を踏み出します。",
          "after": "文字式を操る力を手に入れました！3x、2a+5b...文字を使って数量を表現できるようになりました。\n\n「文字式は、数学の言語だ。これを使いこなせば、あらゆる問題を解ける」",
          "npcDialogue": "文字の賢者: 次は方程式だ。等しいものを等しく保つ...その奥義を学ぶのだ。"
        },
        "jh1-quest03": {
          "before": "方程式の塔の前に立ちます。塔の頂上には「イコール（=）の剣」が封印されています。\n\n「両辺が等しい...その関係を保ちながら、未知数xを見つけ出せ。それが方程式を解くということだ」\n\n一次方程式の試練が始まります。",
          "after": "一次方程式を解く力を手に入れました！x + 5 = 12、3x = 15...未知数を求めることで、様々な問題が解決できるようになりました。\n\n「イコールの剣」があなたの手に輝きます。",
          "npcDialogue": "方程式の守護者: 素晴らしい。第1章はここまでだ。次は比例と反比例...関数の世界が待っている。"
        }
      },
      "chapterEnd": "第1章完了！\n\n正負の数、文字式、一次方程式...数学の基礎を手に入れたあなたは、守護者としての第一歩を踏み出しました。しかし、数理世界はさらに広大です。"
    },
    {
      "chapterId": 2,
      "title": "第2章: 関数と図形の調和",
      "questIds": ["jh1-quest04", "jh1-quest05", "jh1-quest06"],
      "recommendedLevel": 15,
      "intro": "方程式の力を手に入れたあなたに、次なる試練が待ち受けています。\n\n比例と反比例、平面図形、空間図形...数理世界は代数と幾何が調和して成り立っています。両方の力を手に入れることで、真の守護者への道が開かれます。",
      "questStories": {
        "jh1-quest04": {
          "before": "方程式を使って、現実の問題を解決する時が来ました。\n\n「森の魔法使いが言った：3匹のドラゴンがいて、それぞれ4つの宝石を持っている。全部で何個の宝石があるかな？」\n\n方程式を立てて、未知数を求める力を身につけます。",
          "after": "方程式の利用をマスターしました！年齢の問題、速さの問題、個数の問題...様々な文章題を方程式で解決できるようになりました。\n\n「方程式は、現実の問題を解く鍵だ」",
          "npcDialogue": "方程式の賢者: 次は比例と反比例だ。変化する世界の法則を学べ。"
        },
        "jh1-quest05": {
          "before": "比例の谷と反比例の山、二つの場所が見えます。\n\n「yはxに比例する...y = ax。この関係を理解することで、変化する世界の法則が見えてくる」\n\n関数という新しい概念が、あなたを待っています。",
          "after": "比例と反比例の法則を理解しました！変化する二つの量の関係を、式とグラフで表現できるようになりました。\n\n「関数は、世界の動きを記述する言語だ」賢者が教えてくれます。",
          "npcDialogue": "関数の賢者: 次は図形だ。平面の世界で、円と角の美しさを学べ。"
        },
        "jh1-quest06": {
          "before": "幾何の平原に降り立ちます。ここでは、円、三角形、四角形が規則正しく並んでいます。\n\n「円の面積は πr²、円周は 2πr。図形には美しい公式がある。論理的に考えることで、見えないものが見えてくる」\n\n平面図形の奥深さを学びます。",
          "after": "平面図形の性質を理解しました！円周、円の面積、作図、平行線と角...図形を論理的に分析する力を手に入れました。\n\n美しい幾何学の世界が、あなたの前に広がります。",
          "npcDialogue": "幾何の守護者: 平面を制した者は、次は空間だ。3次元の世界が待っている。"
        }
      },
      "chapterEnd": "第2章完了！\n\n関数と図形、代数と幾何の両方を手に入れたあなたは、数理世界のバランスを理解し始めました。最後の試練が待っています。"
    },
    {
      "chapterId": 3,
      "title": "第3章: 統計と確率、そして最終試練",
      "questIds": ["jh1-quest07", "jh1-quest08"],
      "recommendedLevel": 20,
      "intro": "数理世界の最深部、「データの海」と「確率の迷宮」。\n\nここでは、不確実性と向き合い、データから真実を見抜く力が試されます。そしてその先に、失われた「バランスの守護者」の謎が待っています。",
      "questStories": {
        "jh1-quest07": {
          "before": "データの海に到着しました。無数のデータが波のように押し寄せてきます。\n\n「データには意味がある。平均、中央値、最頻値...データを分析することで、隠れた真実が見えてくる」\n\nデータ分析の力を学びます。",
          "after": "データ分析の力を手に入れました！ヒストグラム、相対度数、代表値...データから情報を読み取り、適切に判断できるようになりました。\n\n「データは、世界を理解する鍵だ」",
          "npcDialogue": "データの賢者: 最後は確率だ。未来を予測する力...それが確率の本質だ。"
        },
        "jh1-quest08": {
          "before": "確率の迷宮、最後の試練の場所に到着しました。\n\nここには、失われた「バランスの守護者」の影が見えます。「起こりうる場合の数...確率の本質を理解した者だけが、私の後継者となれる」\n\nサイコロ、コイン、カード...様々な確率の問題があなたを待ち受けます。これが最後の試練です！",
          "after": "確率をマスターし、最終試練を突破しました！\n\n「バランスの守護者」の影が実体を持ち、あなたの前に現れます。「よくやった。正と負、文字と式、関数と図形、データと確率...すべてを理解したお前こそ、新たな守護者だ」\n\n光に包まれたあなたは、正式に「数理世界の守護者」となりました。正の世界と負の世界が再び調和し、ゼロポイントに光が戻ります。\n\n数理世界に平和が訪れました！",
          "npcDialogue": "バランスの守護者: 中学1年の旅、ご苦労様。しかし、数学の道はまだまだ続く。中学2年では、さらに深い世界が待っているぞ。",
          "ending": true
        }
      },
      "chapterEnd": "🎉 中学1年生の数学、完全制覇！\n\nあなたは正負の数、文字式、方程式、関数、図形、データ分析、確率...すべてをマスターしました。\n\n数理世界の守護者として、あなたの名は永遠に刻まれるでしょう。しかし、数学の探求は終わりません。中学2年では、連立方程式、一次関数、証明という新たな力が待っています！\n\n次の冒険で、また会いましょう！"
    }
  ],
  "epilogue": "数理世界の新たな守護者の誕生。バランスと調和を取り戻した世界で、数学はさらなる進化を遂げます..."
}
