{
  "gradeId": "jh2",
  "storyTitle": "連立方程式と証明の試練",
  "description": "2つの未知数を解き、図形を論理で証明する。数学の真の力を手に入れる旅",
  "mainTheme": "論理と証明こそが、数学の本質である",
  "chapters": [
    {
      "chapterId": 1,
      "title": "第1章: 式の力を高めよ",
      "questIds": ["jh2-quest01", "jh2-quest02"],
      "recommendedLevel": 13,
      "intro": "中学1年で数理世界の守護者となったあなたに、新たな試練が待っています。\n\n「代数の大陸」では、文字式がさらに進化します。多項式の計算、等式の変形...式を自由に操る力を手に入れることで、次なる試練「連立方程式」への道が開かれます。",
      "questStories": {
        "jh2-quest01": {
          "before": "代数の大陸の入り口に立ちます。目の前には「多項式の森」が広がっています。\n\n「2a + 3b、3x² - 5x + 2...多項式は、単項式の和だ。同類項をまとめ、分配法則を使って計算する。式の計算力を、さらに高めよう」\n\n多項式の計算を学びます。",
          "after": "多項式の計算をマスターしました！カッコを外し、同類項をまとめ、複雑な式を整理する力が身につきました。\n\n「式を操る力が、数学の基礎だ」代数の賢者が教えてくれます。",
          "npcDialogue": "代数の賢者: 次は文字式の利用だ。等式の変形、文字での説明...実用的な力を学ぼう！"
        },
        "jh2-quest02": {
          "before": "「等式変形の塔」に登ります。様々な公式が壁に刻まれています。\n\n「V = πr²h を h について解くと...h = V/(πr²)。等式を変形して、必要な文字を求める。そして、文字式を使って、偶数の性質、倍数の性質を説明する」\n\n等式の変形と、文字を使った説明を学びます。",
          "after": "等式の変形と文字式の利用をマスターしました！公式の変形、性質の証明...文字を使って論理的に考える力が身につきました。\n\n「これは、証明への第一歩だ」塔の守護者が微笑みます。",
          "npcDialogue": "塔の守護者: 第1章完了だ。次はいよいよ連立方程式、2つの未知数を解く力だ！"
        }
      },
      "chapterEnd": "第1章完了！\n\n多項式の計算、等式の変形、文字を使った説明...代数の力が大きく成長しました。次は、連立方程式という強力な武器を手に入れます。"
    },
    {
      "chapterId": 2,
      "title": "第2章: 連立方程式の奥義",
      "questIds": ["jh2-quest03", "jh2-quest04"],
      "recommendedLevel": 17,
      "intro": "代数の大陸の中心に、「連立の神殿」がそびえ立っています。\n\nこれまでの一元一次方程式は、1つの未知数を求めました。しかし、連立方程式は2つの未知数を同時に求めます。xとy、2つの文字を使いこなす力...それは、複雑な問題を解決する強力な武器です。",
      "questStories": {
        "jh2-quest03": {
          "before": "神殿の入り口に、2つの式が刻まれています。\n\n「x + y = 5、x - y = 1。2つの式を同時に満たすxとyは？これが連立方程式だ。加減法、代入法...2つの解き方を学ぼう」\n\n連立方程式の解法を学びます。",
          "after": "連立方程式をマスターしました！加減法と代入法、両方の解き方を使いこなし、2つの未知数を求められるようになりました。\n\n「2つの式、2つの未知数...バランスを保ちながら解く。これが連立方程式の本質だ」神殿の守護者が教えてくれます。",
          "npcDialogue": "神殿の守護者: 次は連立方程式の利用だ。現実の複雑な問題を解こう！"
        },
        "jh2-quest04": {
          "before": "神殿の奥の間、「応用の間」に入ります。複雑な文章題が待っています。\n\n「りんご x 個とみかん y 個、合わせて10個。値段の合計は800円...2つの条件から、連立方程式を立てる。代金の問題、速さの問題、割合の問題...連立方程式で解決できる」\n\n連立方程式の文章題に挑戦します。",
          "after": "連立方程式の利用をマスターしました！複雑な状況を2つの式で表し、未知数を求める...問題解決力が大きく成長しました。\n\n「2つの視点から問題を捉える...これが連立方程式の強みだ」応用の賢者が称賛します。",
          "npcDialogue": "応用の賢者: 第2章完了だ。次は一次関数、変化する世界をもっと深く理解しよう！"
        }
      },
      "chapterEnd": "第2章完了！\n\n連立方程式の解法と応用...2つの未知数を解く強力な武器を手に入れました。複雑な問題も、連立方程式で解決できるようになりました。"
    },
    {
      "chapterId": 3,
      "title": "第3章: 一次関数の完成",
      "questIds": ["jh2-quest05", "jh2-quest06"],
      "recommendedLevel": 21,
      "intro": "代数の旅を終え、次は「関数の海」へ。\n\n中学1年で学んだ比例と反比例に加え、一次関数という新しい関数を学びます。y = ax + b...傾きと切片で表される直線。変化する世界を、より正確に記述する力を手に入れましょう。",
      "questStories": {
        "jh2-quest05": {
          "before": "関数の海に船を漕ぎ出します。海面には、無数の直線が描かれています。\n\n「y = 2x + 3。これが一次関数だ。傾き a は変化の割合、切片 b は y 切片。グラフを描き、式を求め、変化を読み取る...一次関数の本質を理解しよう」\n\n一次関数のグラフと式を学びます。",
          "after": "一次関数をマスターしました！傾きと切片から直線を描く、2点から式を求める、グラフから情報を読み取る...直線を自由に扱えるようになりました。\n\n「一次関数は、現実世界の変化を表す強力な道具だ」関数の守護者が教えてくれます。",
          "npcDialogue": "関数の守護者: 次は一次関数の利用だ。動点問題、グラフの交点...応用に挑戦しよう！"
        },
        "jh2-quest06": {
          "before": "「関数応用の島」に上陸します。ここでは、一次関数を使った複雑な問題が待っています。\n\n「点Pが毎秒2cmで動く時...動点問題だ。グラフの交点の座標、2つの一次関数の関係...一次関数を使って、様々な問題を解決しよう」\n\n一次関数の応用問題に挑戦します。",
          "after": "一次関数の利用をマスターしました！動く点の座標、グラフの交点、変化の速さ...複雑な問題も一次関数で解決できるようになりました。\n\n「関数は、世界の動きを数式で捉える。美しいね」島の賢者が微笑みます。",
          "npcDialogue": "島の賢者: 第3章完了だ。次はいよいよ幾何、図形の証明の世界だ！"
        }
      },
      "chapterEnd": "第3章完了！\n\n一次関数のグラフと式、そして応用...変化する世界を完全に記述できるようになりました。関数を使いこなす力は、高校数学へも続く大切な力です。"
    },
    {
      "chapterId": 4,
      "title": "第4章: 証明の試練と確率の法則",
      "questIds": ["jh2-quest07", "jh2-quest08", "jh2-quest09", "jh2-quest10"],
      "recommendedLevel": 25,
      "intro": "旅の最終段階、「幾何の王国」へ。\n\nここでは、図形の性質を論理的に証明する力が試されます。そして、四角形の性質、確率という新しい概念...これらすべてをマスターすれば、中学2年の数学を完全に制覇します！",
      "questStories": {
        "jh2-quest07": {
          "before": "幾何の王国の門をくぐります。「三角形の宮殿」が見えます。\n\n「二等辺三角形の底角は等しい。直角三角形の合同条件...三角形には美しい性質がたくさんある。まずは性質を理解しよう」\n\n三角形の定理を学びます。",
          "after": "三角形の性質をマスターしました！二等辺三角形、正三角形、直角三角形...それぞれの特別な性質を理解できました。\n\n「性質を理解したら、次は証明だ」宮殿の守護者が告げます。",
          "npcDialogue": "宮殿の守護者: いよいよ証明だ。論理で図形を理解する...数学の真髄を学ぼう！"
        },
        "jh2-quest08": {
          "before": "「証明の聖域」に入ります。ここでは、直感ではなく、論理で図形を理解します。\n\n「合同な三角形を見つけ、対応する辺や角が等しいことを示す...これが証明だ。仮定、証明すべきこと、そして論理的な流れ。厳密に考えるんだ」\n\nこれまでで最も難しい試練、図形の証明に挑みます。",
          "after": "図形の証明をマスターしました！論理的に考え、根拠を示しながら結論を導く...証明の力を手に入れました。\n\n「証明は難しい。でも、これこそが数学の本質だ」聖域の大賢者が称賛します。「論理的思考力は、数学以外でも役立つ」",
          "npcDialogue": "聖域の大賢者: 次は四角形だ。平行四辺形の性質と証明を学ぼう！"
        },
        "jh2-quest09": {
          "before": "「四角形の広場」に到着しました。平行四辺形、長方形、ひし形、正方形...様々な四角形が並んでいます。\n\n「平行四辺形の対辺は等しい、対角は等しい、対角線は中点で交わる...性質を理解し、証明する。そして、平行四辺形になる条件も学ぼう」\n\n四角形の性質と証明を学びます。",
          "after": "平行四辺形の性質をマスターしました！性質を使って証明し、条件から平行四辺形と判断する...論理的思考力がさらに成長しました。\n\n「四角形は、三角形の組み合わせだ。基礎が大切だね」広場の賢者が教えてくれます。",
          "npcDialogue": "広場の賢者: 最後は確率だ。未来を予測する力、不確実性を数で表す力を学ぼう！"
        },
        "jh2-quest10": {
          "before": "最後の試練、「確率の迷宮」に入ります。\n\n「2つのサイコロを投げる時、目の和が7になる確率は？樹形図、表...場合の数を整理し、確率を求める。確率 = (ある事柄の起こる場合の数)/(すべての場合の数)」\n\nこれが中学2年の最終試練です！",
          "after": "確率をマスターしました！\n\n迷宮を抜けると、幾何の王国の中央広場に出ます。すべての守護者が集まっています。\n\n「おめでとう！多項式、連立方程式、一次関数、図形の証明、確率...中学2年のすべてをマスターした！」\n\n光に包まれたあなたは、「中学2年数学の達人」の称号を得ました。\n\n「論理的思考力を手に入れたお前は、もう立派な数学者だ。中学3年では、さらに高度な世界が待っている。二次方程式、二次関数、相似、三平方の定理...準備はいいか？」\n\nあなたは自信を持って頷きます。新たな冒険が、また始まります！",
          "npcDialogue": "すべての守護者たち: 中学2年、お疲れ様！証明という難関を乗り越えたお前は素晴らしい。中学3年で、中学数学を完成させよう！",
          "ending": true
        }
      },
      "chapterEnd": "🎉 中学2年生の数学、完全制覇！\n\nあなたは連立方程式、一次関数、そして図形の証明という難関をすべて乗り越えました。\n\n特に証明は、数学の本質である論理的思考力を鍛える重要な分野です。この力は、数学だけでなく、人生のあらゆる場面で役立つでしょう。\n\n中学3年では、二次方程式、二次関数、相似、三平方の定理...中学数学の集大成が待っています！\n\n次の冒険で、また会いましょう！"
    }
  ],
  "epilogue": "連立方程式を解き、図形を論理で証明した数学者の物語は、永遠に語り継がれることでしょう..."
}
