{
  "gradeId": "jh3",
  "storyTitle": "中学数学の完成と高校への扉",
  "description": "二次方程式と二次関数、相似と三平方の定理。中学数学の集大成",
  "mainTheme": "すべての学びが一つに繋がり、数学の全体像が見えてくる",
  "chapters": [
    {
      "chapterId": 1,
      "title": "第1章: 多項式の究極形態",
      "questIds": ["jh3-quest01", "jh3-quest02", "jh3-quest03", "jh3-quest04"],
      "recommendedLevel": 15,
      "intro": "中学数学の最終章が始まります。\n\n「代数の極地」では、これまで学んだ式の計算が究極の形態へと進化します。展開、因数分解、そして平方根...これらをマスターすることで、二次方程式への道が開かれます。\n\nこれは、代数の力を完成させる旅です！",
      "questStories": {
        "jh3-quest01": {
          "before": "代数の極地に到着しました。目の前には「展開の神殿」が立っています。\n\n「(a+b)² = a² + 2ab + b²、(a+b)(a-b) = a² - b²...乗法公式だ。この公式を完全に使いこなせば、複雑な式も一瞬で展開できる」\n\n展開の奥義を学びます。",
          "after": "展開の公式をマスターしました！乗法公式を使いこなし、複雑な式を素早く展開できるようになりました。\n\n「展開は、式を広げる力だ」神殿の守護者が教えてくれます。「次は逆の力、因数分解だ」",
          "npcDialogue": "神殿の守護者: 因数分解は、展開の逆だ。式をカッコでくくる力を学ぼう！"
        },
        "jh3-quest02": {
          "before": "「因数分解の塔」に登ります。展開の逆、式をカッコでくくる力を学びます。\n\n「x² - 9 = (x+3)(x-3)、x² + 5x + 6 = (x+2)(x+3)...因数分解は、式を因数の積で表す。共通因数、公式、たすきがけ...様々な方法を使いこなそう」\n\n因数分解の技術を学びます。",
          "after": "因数分解をマスターしました！公式を使い、たすきがけを使い、複雑な式を因数の積に分解できるようになりました。\n\n「因数分解は、二次方程式を解く鍵だ」塔の守護者が告げます。「次は平方根だ」",
          "npcDialogue": "塔の守護者: 次は新しい数、平方根だ。√の世界へようこそ！"
        },
        "jh3-quest03": {
          "before": "「根号の森」に入ります。√という記号、平方根という新しい数の世界です。\n\n「√4 = 2、√9 = 3...2乗するとその数になる数が平方根だ。そして√2、√3...無理数という、永遠に続く小数もある」\n\n平方根の概念を学びます。",
          "after": "平方根の基礎をマスターしました！根号の意味、平方根の大小、無理数の概念...新しい数の世界が理解できました。\n\n「数の世界は、まだまだ広い」森の賢者が微笑みます。",
          "npcDialogue": "森の賢者: 次は平方根の計算だ。根号を含む式の四則演算を学ぼう！"
        },
        "jh3-quest04": {
          "before": "「根号計算の泉」に到着しました。根号を含む複雑な計算に挑戦します。\n\n「√2 × √3 = √6、√12 = 2√3...根号の掛け算・割り算。そして√2 + √3 は簡単にできないけど、2√3 + 5√3 = 7√3 はできる。有理化も学ぼう」\n\n根号の計算技術を学びます。",
          "after": "平方根の計算をマスターしました！根号の四則演算、簡単にする方法、有理化...すべての技術を使いこなせるようになりました。\n\n「これで準備は整った」泉の守護者が告げます。「いよいよ二次方程式だ！」",
          "npcDialogue": "泉の守護者: 第1章完了だ。次は二次方程式、中学数学の核心に進もう！"
        }
      },
      "chapterEnd": "第1章完了！\n\n展開、因数分解、平方根...代数の力が究極まで高まりました。これらすべてが、二次方程式を解くための準備だったのです。"
    },
    {
      "chapterId": 2,
      "title": "第2章: 二次方程式と二次関数の世界",
      "questIds": ["jh3-quest05", "jh3-quest06", "jh3-quest07", "jh3-quest08"],
      "recommendedLevel": 20,
      "intro": "代数の極地の中心に、「二次の大聖堂」がそびえ立っています。\n\nこれまでの一次方程式、一次関数に加え、二次の世界が開かれます。x²を含む方程式、放物線を描く関数...二次の世界は、より複雑で、より美しい世界です。",
      "questStories": {
        "jh3-quest05": {
          "before": "大聖堂の入り口に立ちます。「x² - 5x + 6 = 0」と刻まれています。\n\n「二次方程式は、因数分解、平方完成、解の公式...3つの解き方がある。因数分解できる時は因数分解、できない時は解の公式を使う」\n\n二次方程式の解法を学びます。",
          "after": "二次方程式をマスターしました！3つの解き方を使い分け、どんな二次方程式も解けるようになりました。\n\n「解の公式は万能だ。でも、因数分解できる時は因数分解の方が速い」大聖堂の守護者が教えてくれます。",
          "npcDialogue": "大聖堂の守護者: 次は二次方程式の利用だ。現実の問題を解こう！"
        },
        "jh3-quest06": {
          "before": "「応用の間」に入ります。二次方程式を使った文章題が待っています。\n\n「連続する2つの整数の積が56...x(x+1) = 56。数の問題、図形の問題、動きの問題...二次方程式で解決できる問題は多い」\n\n二次方程式の応用問題に挑戦します。",
          "after": "二次方程式の利用をマスターしました！複雑な状況を二次方程式で表し、解を求める...高度な問題解決力が身につきました。\n\n「二次方程式は強力な武器だ」応用の賢者が称賛します。",
          "npcDialogue": "応用の賢者: 次は二次関数だ。放物線の美しさを学ぼう！"
        },
        "jh3-quest07": {
          "before": "大聖堂の最上階、「放物線の間」に到着しました。美しい曲線が描かれています。\n\n「y = ax²。これが二次関数だ。xが変わると、yは2乗で変わる。グラフは放物線、下に凸か上に凸か、変化の割合は一定じゃない...一次関数とは違う世界だ」\n\n二次関数のグラフと性質を学びます。",
          "after": "二次関数をマスターしました！放物線を描き、変域を考え、変化の割合を求める...二次関数の本質を理解できました。\n\n「放物線は、自然界にもたくさんある。ボールの軌道、橋のアーチ...美しい曲線だね」放物線の守護者が教えてくれます。",
          "npcDialogue": "放物線の守護者: 次は二次関数の利用だ。最大値・最小値を求めよう！"
        },
        "jh3-quest08": {
          "before": "「最適化の部屋」に入ります。二次関数を使った応用問題に挑戦します。\n\n「長方形の周りの長さが20mの時、面積の最大値は？面積 = x(10-x) = -x² + 10x...二次関数で表し、頂点を求める。最大・最小問題は、実生活で役立つ」\n\n二次関数の応用を学びます。",
          "after": "二次関数の利用をマスターしました！最大値・最小値を求め、実生活の問題を解決する力が身につきました。\n\n「二次関数は、最適化の道具だ」部屋の賢者が微笑みます。",
          "npcDialogue": "賢者: 第2章完了だ。次は図形の世界、相似の奥義を学ぼう！"
        }
      },
      "chapterEnd": "第2章完了！\n\n二次方程式と二次関数...二次の世界を完全に理解しました。代数の力が完成に近づいています。次は、図形の世界が待っています。"
    },
    {
      "chapterId": 3,
      "title": "第3章: 相似と三平方の定理",
      "questIds": ["jh3-quest09", "jh3-quest10", "jh3-quest11", "jh3-quest12"],
      "recommendedLevel": 25,
      "intro": "代数の旅を終え、「幾何の最終領域」へ。\n\n相似は、拡大と縮小の関係です。そして三平方の定理は、直角三角形の最も美しい定理です。これらをマスターすれば、図形の世界を完全に制覇することになります。",
      "questStories": {
        "jh3-quest09": {
          "before": "「相似の宮殿」に到着しました。大きさは違うけど、形は同じ図形が並んでいます。\n\n「相似な図形は、対応する角が等しく、対応する辺の比が等しい。相似比が1:2なら、面積比は1:4、体積比は1:8...相似の性質を学ぼう」\n\n相似の基礎を学びます。",
          "after": "相似な図形をマスターしました！相似の条件、相似比、面積比、体積比...相似の基本が完全に理解できました。\n\n「相似は、拡大縮小の数学だ」宮殿の守護者が教えてくれます。",
          "npcDialogue": "宮殿の守護者: 次は相似の証明と利用だ。線分比を求める技術を学ぼう！"
        },
        "jh3-quest10": {
          "before": "「相似証明の間」に入ります。三角形の相似を証明し、線分の長さを求めます。\n\n「平行線と線分の比、中点連結定理...相似を使えば、見えない長さが見えてくる。証明と計算、両方の力が試される」\n\n相似の証明と計量を学びます。",
          "after": "相似の証明と利用をマスターしました！三角形の相似を見抜き、線分比から長さを求める...高度な幾何学の力が身につきました。\n\n「相似は、測量の基礎だ。実生活でも役立つ」証明の賢者が称賛します。",
          "npcDialogue": "証明の賢者: 次はいよいよ三平方の定理だ。直角三角形の最も美しい定理を学ぼう！"
        },
        "jh3-quest11": {
          "before": "「ピタゴラスの聖域」に入ります。ここには、数学史上最も有名な定理が封印されています。\n\n「a² + b² = c²。直角三角形の2辺が分かれば、残りの1辺が求められる。この定理は、何千年も前から知られている...数学の宝だ」\n\n三平方の定理を学びます。",
          "after": "三平方の定理をマスターしました！直角三角形の辺の長さ、平面図形での応用、空間図形での応用...様々な問題が解けるようになりました。\n\n「美しい定理だね」聖域の大賢者が微笑みます。「この定理は、高校数学でも使い続ける」",
          "npcDialogue": "聖域の大賢者: 次は三平方の定理の応用だ。立体での最短距離を求めよう！"
        },
        "jh3-quest12": {
          "before": "「空間図形の塔」に登ります。立体での三平方の定理の応用に挑戦します。\n\n「直方体の対角線の長さ、円錐の母線の長さ、立体の表面上の最短距離...三平方の定理を使えば、空間の中の長さが求められる」\n\n三平方の定理の応用を極めます。",
          "after": "三平方の定理の応用をマスターしました！平面でも空間でも、直角三角形を見つければ長さが求められる...幾何学の力が完成しました。\n\n「三平方の定理は、数学の宝だ」塔の守護者が教えてくれます。",
          "npcDialogue": "塔の守護者: 第3章完了だ。最終章、円と統計の世界へ！"
        }
      },
      "chapterEnd": "第3章完了！\n\n相似と三平方の定理...幾何学の最高峰をマスターしました。図形を見る目、論理的に考える力、計算する力...すべてが一つになりました。"
    },
    {
      "chapterId": 4,
      "title": "第4章: 円の極意と最終試練",
      "questIds": ["jh3-quest13", "jh3-quest14", "jh3-quest15"],
      "recommendedLevel": 30,
      "intro": "中学数学の最終章です。「円の神殿」と「統計の塔」、そして最後の試練が待っています。\n\n円周角の定理、円と相似の融合、そして標本調査...これらすべてをマスターすれば、中学数学を完全に制覇します。そして、高校数学という新たな世界への扉が開かれるのです！",
      "questStories": {
        "jh3-quest13": {
          "before": "「円の神殿」に入ります。完璧な円が、神秘的な光を放っています。\n\n「円周角の定理: 1つの弧に対する円周角は、中心角の半分。そして、円に内接する四角形の対角の和は180°...円には美しい性質がたくさんある」\n\n円の性質を学びます。",
          "after": "円の性質をマスターしました！円周角の定理、接線と弦の関係、方べきの定理...円の幾何学を完全に理解できました。\n\n「円は完璧な図形だ。その性質も完璧に美しい」神殿の守護者が教えてくれます。",
          "npcDialogue": "神殿の守護者: 次は円の応用だ。円と相似を組み合わせた問題に挑戦しよう！"
        },
        "jh3-quest14": {
          "before": "「円と相似の融合の間」に入ります。これまで学んだすべての幾何学の知識を使う、最も難しい問題に挑戦します。\n\n「円に内接する三角形、接線、相似な三角形...複数の定理を組み合わせて使う。これが幾何学の真髄だ」\n\n最高難度の幾何問題に挑みます。",
          "after": "円の応用問題をマスターしました！複雑な図形でも、定理を組み合わせて解決できるようになりました。\n\n「幾何学のすべてが、ここで一つになったね」融合の賢者が称賛します。",
          "npcDialogue": "融合の賢者: 最後は標本調査だ。統計の最終段階を学ぼう！"
        },
        "jh3-quest15": {
          "before": "最後の試練、「標本調査の塔」に到着しました。塔の頂上には、中学数学の最終問題が待っています。\n\n「全数調査と標本調査、母集団と標本、無作為抽出...すべてを調べられない時、一部から全体を推定する。統計の力だ」\n\nこれが中学数学の最終試練です！",
          "after": "標本調査をマスターしました！\n\n塔の頂上に立つと、虹色の光が空を覆います。中学数学のすべての守護者が集まります。\n\n「おめでとう！正負の数、文字式、方程式、関数、図形、証明、二次方程式、二次関数、相似、三平方の定理、円、統計...中学数学のすべてをマスターした！」\n\n光に包まれたあなたは、「中学数学グランドマスター」の称号を得ました。3年間の長い旅が、ここに完結します。\n\nしかし、これは終わりではありません。遠くに、巨大な門が現れます。「高校数学への門」です。\n\n「数列、ベクトル、微分、積分、複素数、行列...さらに広く、深く、美しい世界が待っている。お前なら、きっと乗り越えられる。中学で学んだすべてが、高校数学の土台となる。自信を持って進め！」\n\nあなたは門に手をかけます。新たな数学の冒険が、今、始まろうとしています！",
          "npcDialogue": "すべての守護者たち: 中学3年間、本当にお疲れ様！お前は数学の真の力を手に入れた。論理的思考、問題解決力、抽象的思考...これらは一生の宝だ。高校数学も、恐れず進め。我々は、いつもお前を見守っている！",
          "ending": true
        }
      },
      "chapterEnd": "🎉 中学数学、完全制覇！\n\nあなたは3年間かけて、中学数学のすべてをマスターしました。\n\n正負の数から始まり、文字式、方程式、関数、図形の証明、二次方程式、二次関数、相似、三平方の定理、円...小学算数とは次元の違う、深く美しい数学の世界を探検しました。\n\n論理的思考力、問題解決力、抽象的思考力...これらは数学だけでなく、人生のあらゆる場面で役立つ力です。\n\n高校数学は、中学数学の延長です。数列、ベクトル、微分積分...さらに広く深い世界が待っています。これまで学んだすべてを土台に、新たな冒険に進みましょう！\n\n数学の旅は、まだまだ続きます。いつか、大学数学、そしてその先の世界でも会えることを楽しみにしています！"
    }
  ],
  "epilogue": "中学数学を完全に制覇し、高校数学への門を開いたグランドマスターの伝説は、永遠に語り継がれることでしょう。数学の旅は、これからも続く..."
}
